Revit 2027 API
BuiltInFailures.GroupFailures.UnableToReplaceSelectedGroups Property
 Unable to change the types of the groups you have selected and the related groups. You might try deleting the groups you wish to change and placing or copy/pasting new groups of the desired type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnableToReplaceSelectedGroups { get; }
Public Shared ReadOnly Property UnableToReplaceSelectedGroups As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnableToReplaceSelectedGroups {
	FailureDefinitionId^ get ();
}
static member UnableToReplaceSelectedGroups : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace